app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "age", "gender", "designation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "praven"], ["age", 22], ["gender", "male"], ["designation", "it"], ["created_at", "2020-05-18 10:24:32.593307"], ["updated_at", "2020-05-18 10:24:32.593307"]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]